content/notes/rust.org
#+TITLE: Rust 4 Dummies

* Idioms
Idioms are commonly used styles, guidelines and patterns largely agreed upon by
a community. Writing idiomatic code allows developers to understand better what
is happening.

** Use of borrowed types for arguments
Using a target of a deref coercion can increase the flexibility of your code
when you are deciding which argument type to use for a function argument. In
this way, the function will accept more input types. Deref coercion is defined
in the rust programming language as:

#+begin_center
Deref coercion converts a reference to a type that implements the Deref trait
into a reference to another type. For example, deref coercion can convert
&String to &str because String implements the Deref trait such that it returns
&str.
#+end_center

As an example of this:

#+begin_src rust
  fn three_vowels(word: &String) -> bool {
    let mut vowel_count = 0;
    for c in word.chars() {
        match c {
            'a' | 'e' | 'i' | 'o' | 'u' => {
                vowel_count += 1;
                if vowel_count >= 3 {
                    return true
                }
            }
            _ => vowel_count = 0
        }
    }
    false
}

fn main() {
    let ferris = "Ferris".to_string();
    let curious = "Curious".to_string();
    println!("{}: {}", ferris, three_vowels(&ferris));
    println!("{}: {}", curious, three_vowels(&curious));

    // This works fine, but the following two lines would fail:
    // println!("Ferris: {}", three_vowels("Ferris"));
    // println!("Curious: {}", three_vowels("Curious"));

}
#+end_src

The commented out code *does not run* because a normal* ~&str~ cannot be
"derefrenced" to a ~&String~, whereas the opposite is true. To have the whole
file run, simply change the function parameter to

#+begin_src rust
  fn three_vowels(word: &str) -> bool { ...
#+end_src

** Concatenating strings with ~format!~
It is often more convenient to use ~format!~ to build up strings, especially
when there is a mix of literal and non-literal strings.

#+begin_src rust
fn say_hello(name: &str) -> String {
    // We could construct the result string manually.
    // let mut result = "Hello ".to_owned();
    // result.push_str(name);
    // result.push('!');
    // result

    // But using format! is better.
    format!("Hello {}!", name)
}
#+end_src

*** Disadvantages
It is usually not the most efficient way to combine strings - a series of push
operations on a mutable string is usually the most efficient (especially if the
string has been pre-allocated to the expected size).

** Constructors
Rust does not have constructors, so the common keyword is to use ~new~.

#+begin_src rust
/// Time in seconds.
///
/// # Example
///
/// ```
/// let s = Second::new(42);
/// assert_eq!(42, s.value());
/// ```
pub struct Second {
    value: u64
}

impl Second {
    // Constructs a new instance of [`Second`].
    // Note this is an associated function - no self.
    pub fn new(value: u64) -> Self {
        Self { value }
    }

    /// Returns the value in seconds.
    pub fn value(&self) -> u64 {
        self.value
    }
}
#+end_src

*** Default Constructors
Rust supports default constructors

#+begin_src rust
impl Default for Second {
    fn default() -> Self {
        Self { value: 0 }
    }
}
#+end_src

Another way to do this is to use derive default on the structure

#+begin_src rust
#[derive(Default)]
pub struct Second {
    value: u64
}
#+end_src

** Collections are smart pointers
Use of the ~Deref~ trait to treat collections like smart pointers, offering
owning and borrowed views of data. Example of collections are

- A vector allows you to store a variable number of values next to each other.
- A string is a collection of characters. We’ve mentioned the String type previously, but in this chapter we’ll talk about it in depth.
- A hash map allows you to associate a value with a particular key. It’s a
  particular implementation of the more general data structure called a map.

  #+begin_src rust
use std::ops::Deref;

struct Vec<T> {
    data: RawVec<T>,
    //..
}

impl<T> Deref for Vec<T> {
    type Target = [T];

    fn deref(&self) -> &[T] {
        //..
    }
}
  #+end_src

This means allows implicit derefrencing from ~&Vec<T>~ to ~&T~ and includes
the relationship in auto-derefrencing searches.

** Finalisation in Destructors
An object's destructor can be used to run code that must be ran before exit.

#+begin_src rust
fn bar() -> Result<(), ()> {
    // These don't need to be defined inside the function.
    struct Foo;

    // Implement a destructor for Foo.
    impl Drop for Foo {
        fn drop(&mut self) {
            println!("exit");
        }
    }

    // The dtor of _exit will run however the function `bar` is exited.
    let _exit = Foo;
    // Implicit return with `?` operator.
    baz()?;
    // Normal return.
    Ok(())
}
#+end_src

