docs/rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-16 Thu 19:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rust 4 Dummies</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<h1 class="title">Rust 4 Dummies</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga04fd36">1. Idioms</a>
<ul>
<li><a href="#org8ddaae0">1.1. Use of borrowed types for arguments</a></li>
<li><a href="#org8c9927a">1.2. Concatenating strings with <code>format!</code></a>
<ul>
<li><a href="#org21d30ef">1.2.1. Disadvantages</a></li>
</ul>
</li>
<li><a href="#orgeca4008">1.3. Constructors</a>
<ul>
<li><a href="#orga39e91a">1.3.1. Default Constructors</a></li>
</ul>
</li>
<li><a href="#org88a49b9">1.4. Collections are smart pointers</a></li>
<li><a href="#org55a1e9d">1.5. Finalisation in Destructors</a></li>
<li><a href="#org56e58f0">1.6. <code>mem::{take(_), replace(_)}</code> to keep owned values in changed enums</a></li>
<li><a href="#org279e3fc">1.7. On-Stack Dynamic Dispatch</a></li>
<li><a href="#org86d7eaa">1.8. FFI (foreign function interface) Idioms</a>
<ul>
<li><a href="#org9c4d8b2">1.8.1. Error Handling in FFI</a></li>
<li><a href="#orgac1dc1b">1.8.2. Accepting Strings</a></li>
<li><a href="#orgca700f9">1.8.3. Passing Strings</a></li>
</ul>
</li>
<li><a href="#org0f486c4">1.9. Iterating over an <code>Option</code></a></li>
<li><a href="#org84b3d2a">1.10. Pass variables to closure</a></li>
<li><a href="#org310d242">1.11. Easy doc initialization</a></li>
<li><a href="#org63ddb93">1.12. Temporary mutability</a></li>
</ul>
</li>
<li><a href="#orgb9ed06a">2. Design Patterns</a>
<ul>
<li><a href="#org9aaaa55">2.1. Behavioral Patterns</a>
<ul>
<li><a href="#org49188fa">2.1.1. Command</a></li>
<li><a href="#org7e0f99a">2.1.2. Newtype</a></li>
<li><a href="#orgdc93084">2.1.3. Resource Acquisition is Initialization (RAII)</a></li>
<li><a href="#org27950c4">2.1.4. Strategy (aka Policy)</a></li>
<li><a href="#orge8efd75">2.1.5. Visitor</a></li>
</ul>
</li>
<li><a href="#orge0aa25c">2.2. Creational Patterns</a>
<ul>
<li><a href="#org9574081">2.2.1. Builder</a></li>
<li><a href="#org7312853">2.2.2. Fold</a></li>
</ul>
</li>
<li><a href="#org9b30ca6">2.3. Structural Patterns</a>
<ul>
<li><a href="#orgc0b71e2">2.3.1. Compose structs together for better borrowing</a></li>
<li><a href="#org47959f3">2.3.2. Prefer small crates</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb6e4d51">3. Functional Usage of Rust</a>
<ul>
<li><a href="#org86a9d24">3.1. Programming paradigms</a></li>
<li><a href="#org71dbcd5">3.2. Generics as Type Classes</a></li>
</ul>
</li>
<li><a href="#orge3aa7ce">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga04fd36" class="outline-2">
<h2 id="orga04fd36"><span class="section-number-2">1.</span> Idioms</h2>
<div class="outline-text-2" id="text-1">
<p>
Idioms are commonly used styles, guidelines and patterns largely agreed upon by
a community. Writing idiomatic code allows developers to understand better what
is happening.
</p>
</div>

<div id="outline-container-org8ddaae0" class="outline-3">
<h3 id="org8ddaae0"><span class="section-number-3">1.1.</span> Use of borrowed types for arguments</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Using a target of a deref coercion can increase the flexibility of your code
when you are deciding which argument type to use for a function argument. In
this way, the function will accept more input types. Deref coercion is defined
in the rust programming language as:
</p>

<div class="org-center">
<p>
Deref coercion converts a reference to a type that implements the Deref trait
into a reference to another type. For example, deref coercion can convert
&amp;String to &amp;str because String implements the Deref trait such that it returns
&amp;str.
</p>
</div>

<p>
As an example of this:
</p>

<div class="org-src-container">
<pre class="src src-rust">  fn three_vowels(word: &amp;String) -&gt; bool {
    let mut vowel_count = 0;
    for c in word.chars() {
	match c {
	    'a' | 'e' | 'i' | 'o' | 'u' =&gt; {
		vowel_count += 1;
		if vowel_count &gt;= 3 {
		    return true
		}
	    }
	    _ =&gt; vowel_count = 0
	}
    }
    false
}

fn main() {
    let ferris = "Ferris".to_string();
    let curious = "Curious".to_string();
    println!("{}: {}", ferris, three_vowels(&amp;ferris));
    println!("{}: {}", curious, three_vowels(&amp;curious));

    // This works fine, but the following two lines would fail:
    // println!("Ferris: {}", three_vowels("Ferris"));
    // println!("Curious: {}", three_vowels("Curious"));

}
</pre>
</div>

<p>
The commented out code <b>does not run</b> because a normal* <code>&amp;str</code> cannot be
"derefrenced" to a <code>&amp;String</code>, whereas the opposite is true. To have the whole
file run, simply change the function parameter to
</p>

<div class="org-src-container">
<pre class="src src-rust">fn three_vowels(word: &amp;str) -&gt; bool { ...
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c9927a" class="outline-3">
<h3 id="org8c9927a"><span class="section-number-3">1.2.</span> Concatenating strings with <code>format!</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
It is often more convenient to use <code>format!</code> to build up strings, especially
when there is a mix of literal and non-literal strings.
</p>

<div class="org-src-container">
<pre class="src src-rust">fn say_hello(name: &amp;str) -&gt; String {
    // We could construct the result string manually.
    // let mut result = "Hello ".to_owned();
    // result.push_str(name);
    // result.push('!');
    // result

    // But using format! is better.
    format!("Hello {}!", name)
}
</pre>
</div>
</div>

<div id="outline-container-org21d30ef" class="outline-4">
<h4 id="org21d30ef"><span class="section-number-4">1.2.1.</span> Disadvantages</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
It is usually not the most efficient way to combine strings - a series of push
operations on a mutable string is usually the most efficient (especially if the
string has been pre-allocated to the expected size).
</p>
</div>
</div>
</div>

<div id="outline-container-orgeca4008" class="outline-3">
<h3 id="orgeca4008"><span class="section-number-3">1.3.</span> Constructors</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Rust does not have constructors, so the common keyword is to use <code>new</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust">/// Time in seconds.
///
/// # Example
///
/// ```
/// let s = Second::new(42);
/// assert_eq!(42, s.value());
/// ```
pub struct Second {
    value: u64
}

impl Second {
    // Constructs a new instance of [`Second`].
    // Note this is an associated function - no self.
    pub fn new(value: u64) -&gt; Self {
	Self { value }
    }

    /// Returns the value in seconds.
    pub fn value(&amp;self) -&gt; u64 {
	self.value
    }
}
</pre>
</div>
</div>

<div id="outline-container-orga39e91a" class="outline-4">
<h4 id="orga39e91a"><span class="section-number-4">1.3.1.</span> Default Constructors</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Rust supports default constructors
</p>

<div class="org-src-container">
<pre class="src src-rust">impl Default for Second {
    fn default() -&gt; Self {
	Self { value: 0 }
    }
}
</pre>
</div>

<p>
Another way to do this is to use derive default on the structure
</p>

<div class="org-src-container">
<pre class="src src-rust">#[derive(Default)]
pub struct Second {
    value: u64
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org88a49b9" class="outline-3">
<h3 id="org88a49b9"><span class="section-number-3">1.4.</span> Collections are smart pointers</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Use of the <code>Deref</code> trait to treat collections like smart pointers, offering
owning and borrowed views of data. Example of collections are
</p>

<ul class="org-ul">
<li>A vector allows you to store a variable number of values next to each other.</li>
<li>A string is a collection of characters. We’ve mentioned the String type previously, but in this chapter we’ll talk about it in depth.</li>
<li><p>
A hash map allows you to associate a value with a particular key. It’s a
particular implementation of the more general data structure called a map.
</p>

<div class="org-src-container">
<pre class="src src-rust">use std::ops::Deref;

struct Vec&lt;T&gt; {
    data: RawVec&lt;T&gt;,
    //..
}

impl&lt;T&gt; Deref for Vec&lt;T&gt; {
    type Target = [T];

    fn deref(&amp;self) -&gt; &amp;[T] {
	//..
    }
}
</pre>
</div></li>
</ul>

<p>
This means allows implicit derefrencing from <code>&amp;Vec&lt;T&gt;</code> to <code>&amp;T</code> and includes
the relationship in auto-derefrencing searches.
</p>
</div>
</div>

<div id="outline-container-org55a1e9d" class="outline-3">
<h3 id="org55a1e9d"><span class="section-number-3">1.5.</span> Finalisation in Destructors</h3>
<div class="outline-text-3" id="text-1-5">
<p>
An object's destructor can be used to run code that must be ran before exit.
</p>

<div class="org-src-container">
<pre class="src src-rust">fn bar() -&gt; Result&lt;(), ()&gt; {
    // These don't need to be defined inside the function.
    struct Foo;

    // Implement a destructor for Foo.
    impl Drop for Foo {
	fn drop(&amp;mut self) {
	    println!("exit");
	}
    }

    // The dtor of _exit will run however the function `bar` is exited.
    let _exit = Foo;
    // Implicit return with `?` operator.
    baz()?;
    // Normal return.
    Ok(())
}
</pre>
</div>
</div>
</div>
