content/notes/rust.org
** ~mem::{take(_), replace(_)}~ to keep owned values in changed enums
Say we have a ~&mut MyEnum~ which has (at least) two variants, ~A { name:
String, x: u8 }~ and ~B { name: String }~. Now we want to change ~MyEnum::A to a
B~ if ~x~ is zero, while keeping ~MyEnum::B~ intact.

We can do this without cloning the ~name~.

#+begin_src rust
use std::mem;

enum MyEnum {
    A { name: String, x: u8 },
    B { name: String }
}

fn a_to_b(e: &mut MyEnum) {
    if let MyEnum::A { name, x: 0 } = e {
        // this takes out our `name` and put in an empty String instead
        // (note that empty strings don't allocate).
        // Then, construct the new enum variant (which will
        // be assigned to `*e`).
        *e = MyEnum::B { name: mem::take(name) }
    }
}

#+end_src

** On-Stack Dynamic Dispatch
We can dynamically dispatch over multiple values, however, to do so, we need to
declare multiple variables to bind differently-typed objects. To extend the
lifetime as necessary, we can use deferred conditional initialization, as seen
below:

#+begin_src rust
use std::io;
use std::fs;


// These must live longer than `readable`, and thus are declared first:
let (mut stdin_read, mut file_read);

// We need to ascribe the type to get dynamic dispatch.
let readable: &mut dyn io::Read = if arg == "-" {
    stdin_read = io::stdin();
    &mut stdin_read
} else {
    file_read = fs::File::open(arg)?;
    &mut file_read
};

// Read from `readable` here.
#+end_src

This code allows us to

- read in a file or
- create a new file

all for the same variable (which gets the handle at the end). Furthermore, We do
not need to allocate anything on the heap. Neither do we need to initialize
something we won't use later, nor do we need to monomorphize the whole code that
follows to work with both ~File~ or ~Stdin~.

** FFI (foreign function interface) Idioms
This section contains idioms that may be useful when doing FFI.

*** Error Handling in FFI
This best practice shows different kinds of error codes, and how to expose them
in a usable way:

- Flat Enums should be converted to integers and returned as codes.
- Structured Enums should be converted to an integer code with a string error
message for detail.
- Custom Error Types should become "transparent", with a C representation.

#+name: Flat Enums
#+begin_src rust
enum DatabaseError {
    IsReadOnly = 1, // user attempted a write operation
    IOError = 2, // user should read the C errno() for what it was
    FileCorrupted = 3, // user should run a repair tool to recover it
}

impl From<DatabaseError> for libc::c_int {
    fn from(e: DatabaseError) -> libc::c_int {
        (e as i8).into()
    }
}
  #+end_src

#+name: Structured Enums
#+begin_src rust
pub mod errors {
    enum DatabaseError {
        IsReadOnly,
        IOError(std::io::Error),
        FileCorrupted(String), // message describing the issue
    }

    impl From<DatabaseError> for libc::c_int {
        fn from(e: DatabaseError) -> libc::c_int {
            match e {
                DatabaseError::IsReadOnly => 1,
                DatabaseError::IOError(_) => 2,
                DatabaseError::FileCorrupted(_) => 3,
            }
        }
    }
}

pub mod c_api {
    use super::errors::DatabaseError;

    #[no_mangle]
    pub extern "C" fn db_error_description(
        e: *const DatabaseError
        ) -> *mut libc::c_char {

        let error: &DatabaseError = unsafe {
            // SAFETY: pointer lifetime is greater than the current stack frame
            &*e
        };

        let error_str: String = match error {
            DatabaseError::IsReadOnly => {
                format!("cannot write to read-only database");
            }
            DatabaseError::IOError(e) => {
                format!("I/O Error: {}", e);
            }
            DatabaseError::FileCorrupted(s) => {
                format!("File corrupted, run repair: {}", &s);
            }
        };

        let c_error = unsafe {
            // SAFETY: copying error_str to an allocated buffer with a NUL
            // character at the end
            let mut malloc: *mut u8 = libc::malloc(error_str.len() + 1) as *mut _;

            if malloc.is_null() {
                return std::ptr::null_mut();
            }

            let src = error_str.as_bytes().as_ptr();

            std::ptr::copy_nonoverlapping(src, malloc, error_str.len());

            std::ptr::write(malloc.add(error_str.len()), 0);

            malloc as *mut libc::c_char
        };

        c_error
    }
}
#+end_src

#+name: Custom Error Types
#+begin_src rust
struct ParseError {
    expected: char,
    line: u32,
    ch: u16
}

impl ParseError { /* ... */ }

/* Create a second version which is exposed as a C structure */
#[repr(C)]
pub struct parse_error {
    pub expected: libc::c_char,
    pub line: u32,
    pub ch: u16
}

impl From<ParseError> for parse_error {
    fn from(e: ParseError) -> parse_error {
        let ParseError { expected, line, ch } = e;
        parse_error { expected, line, ch }
    }
}
#+end_src

*** Accepting Strings
When accepting strings via FFI through pointers, there are two principles that
should be followed:

- Keep foreign strings "borrowed", rather than copying them directly.
- Minimize the amount of complexity and unsafe code involved in converting from a
C-style string to native Rust strings.

*** Passing Strings
When passing strings to FFI functions, there are four principles that should be
followed:

- Make the lifetime of owned strings as long as possible.
- Minimize unsafe code during the conversion.
- If the C code can modify the string data, use ~Vec~ instead of ~CString~.
- Unless the Foreign Function API requires it, the ownership of the string should
not transfer to the callee.

** Iterating over an ~Option~
~Option~ should be seen as a container that contains either zero or one
element. In particular it implements the ~IntoIterator~ trait, and such can be
used with generic code that needs such a type.

#+begin_src rust
let turing = Some("Turing");
let mut logicians = vec!["Curry", "Kleene", "Markov"];

logicians.extend(turing);

// equivalent to
if let Some(turing_inner) = turing {
    logicians.push(turing_inner);
}
#+end_src

This works because ~Option~ implements ~IntoIterator~ and so does ~Vec~.
Therefore if we perform the ~extend~ action it will either work, or not (~OK~ or
~Err~).

