docs/rust.html

<div id="outline-container-org56e58f0" class="outline-3">
<h3 id="org56e58f0"><span class="section-number-3">1.6.</span> <code>mem::{take(_), replace(_)}</code> to keep owned values in changed enums</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Say we have a <code>&amp;mut MyEnum</code> which has (at least) two variants, <code>A { name:
String, x: u8 }</code> and <code>B { name: String }</code>. Now we want to change <code>MyEnum::A to a
B</code> if <code>x</code> is zero, while keeping <code>MyEnum::B</code> intact.
</p>

<p>
We can do this without cloning the <code>name</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust">use std::mem;

enum MyEnum {
    A { name: String, x: u8 },
    B { name: String }
}

fn a_to_b(e: &amp;mut MyEnum) {
    if let MyEnum::A { name, x: 0 } = e {
	// this takes out our `name` and put in an empty String instead
	// (note that empty strings don't allocate).
	// Then, construct the new enum variant (which will
	// be assigned to `*e`).
	*e = MyEnum::B { name: mem::take(name) }
    }
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org279e3fc" class="outline-3">
<h3 id="org279e3fc"><span class="section-number-3">1.7.</span> On-Stack Dynamic Dispatch</h3>
<div class="outline-text-3" id="text-1-7">
<p>
We can dynamically dispatch over multiple values, however, to do so, we need to
declare multiple variables to bind differently-typed objects. To extend the
lifetime as necessary, we can use deferred conditional initialization, as seen
below:
</p>

<div class="org-src-container">
<pre class="src src-rust">use std::io;
use std::fs;


// These must live longer than `readable`, and thus are declared first:
let (mut stdin_read, mut file_read);

// We need to ascribe the type to get dynamic dispatch.
let readable: &amp;mut dyn io::Read = if arg == "-" {
    stdin_read = io::stdin();
    &amp;mut stdin_read
} else {
    file_read = fs::File::open(arg)?;
    &amp;mut file_read
};

// Read from `readable` here.
</pre>
</div>

<p>
This code allows us to
</p>

<ul class="org-ul">
<li>read in a file or</li>
<li>create a new file</li>
</ul>

<p>
all for the same variable (which gets the handle at the end). Furthermore, We do
not need to allocate anything on the heap. Neither do we need to initialize
something we won't use later, nor do we need to monomorphize the whole code that
follows to work with both <code>File</code> or <code>Stdin</code>.
</p>
</div>
</div>

<div id="outline-container-org86d7eaa" class="outline-3">
<h3 id="org86d7eaa"><span class="section-number-3">1.8.</span> FFI (foreign function interface) Idioms</h3>
<div class="outline-text-3" id="text-1-8">
<p>
This section contains idioms that may be useful when doing FFI.
</p>
</div>

<div id="outline-container-org9c4d8b2" class="outline-4">
<h4 id="org9c4d8b2"><span class="section-number-4">1.8.1.</span> Error Handling in FFI</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
This best practice shows different kinds of error codes, and how to expose them
in a usable way:
</p>

<ul class="org-ul">
<li>Flat Enums should be converted to integers and returned as codes.</li>
<li>Structured Enums should be converted to an integer code with a string error</li>
</ul>
<p>
message for detail.
</p>
<ul class="org-ul">
<li>Custom Error Types should become "transparent", with a C representation.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust" id="org1c3b743">enum DatabaseError {
    IsReadOnly = 1, // user attempted a write operation
    IOError = 2, // user should read the C errno() for what it was
    FileCorrupted = 3, // user should run a repair tool to recover it
}

impl From&lt;DatabaseError&gt; for libc::c_int {
    fn from(e: DatabaseError) -&gt; libc::c_int {
	(e as i8).into()
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust" id="org0d8c3c6">pub mod errors {
    enum DatabaseError {
	IsReadOnly,
	IOError(std::io::Error),
	FileCorrupted(String), // message describing the issue
    }

    impl From&lt;DatabaseError&gt; for libc::c_int {
	fn from(e: DatabaseError) -&gt; libc::c_int {
	    match e {
		DatabaseError::IsReadOnly =&gt; 1,
		DatabaseError::IOError(_) =&gt; 2,
		DatabaseError::FileCorrupted(_) =&gt; 3,
	    }
	}
    }
}

pub mod c_api {
    use super::errors::DatabaseError;

    #[no_mangle]
    pub extern "C" fn db_error_description(
	e: *const DatabaseError
	) -&gt; *mut libc::c_char {

	let error: &amp;DatabaseError = unsafe {
	    // SAFETY: pointer lifetime is greater than the current stack frame
	    &amp;*e
	};

	let error_str: String = match error {
	    DatabaseError::IsReadOnly =&gt; {
		format!("cannot write to read-only database");
	    }
	    DatabaseError::IOError(e) =&gt; {
		format!("I/O Error: {}", e);
	    }
	    DatabaseError::FileCorrupted(s) =&gt; {
		format!("File corrupted, run repair: {}", &amp;s);
	    }
	};

	let c_error = unsafe {
	    // SAFETY: copying error_str to an allocated buffer with a NUL
	    // character at the end
	    let mut malloc: *mut u8 = libc::malloc(error_str.len() + 1) as *mut _;

	    if malloc.is_null() {
		return std::ptr::null_mut();
	    }

	    let src = error_str.as_bytes().as_ptr();

	    std::ptr::copy_nonoverlapping(src, malloc, error_str.len());

	    std::ptr::write(malloc.add(error_str.len()), 0);

	    malloc as *mut libc::c_char
	};

	c_error
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust" id="orgdb78ef6">struct ParseError {
    expected: char,
    line: u32,
    ch: u16
}

impl ParseError { /* ... */ }

/* Create a second version which is exposed as a C structure */
#[repr(C)]
pub struct parse_error {
    pub expected: libc::c_char,
    pub line: u32,
    pub ch: u16
}

impl From&lt;ParseError&gt; for parse_error {
    fn from(e: ParseError) -&gt; parse_error {
	let ParseError { expected, line, ch } = e;
	parse_error { expected, line, ch }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac1dc1b" class="outline-4">
<h4 id="orgac1dc1b"><span class="section-number-4">1.8.2.</span> Accepting Strings</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
When accepting strings via FFI through pointers, there are two principles that
should be followed:
</p>

<ul class="org-ul">
<li>Keep foreign strings "borrowed", rather than copying them directly.</li>
<li>Minimize the amount of complexity and unsafe code involved in converting from a</li>
</ul>
<p>
C-style string to native Rust strings.
</p>
</div>
</div>

<div id="outline-container-orgca700f9" class="outline-4">
<h4 id="orgca700f9"><span class="section-number-4">1.8.3.</span> Passing Strings</h4>
<div class="outline-text-4" id="text-1-8-3">
<p>
When passing strings to FFI functions, there are four principles that should be
followed:
</p>

<ul class="org-ul">
<li>Make the lifetime of owned strings as long as possible.</li>
<li>Minimize unsafe code during the conversion.</li>
<li>If the C code can modify the string data, use <code>Vec</code> instead of <code>CString</code>.</li>
<li>Unless the Foreign Function API requires it, the ownership of the string should</li>
</ul>
<p>
not transfer to the callee.
</p>
</div>
</div>
</div>

<div id="outline-container-org0f486c4" class="outline-3">
<h3 id="org0f486c4"><span class="section-number-3">1.9.</span> Iterating over an <code>Option</code></h3>
<div class="outline-text-3" id="text-1-9">
<p>
<code>Option</code> should be seen as a container that contains either zero or one
element. In particular it implements the <code>IntoIterator</code> trait, and such can be
used with generic code that needs such a type.
</p>

<div class="org-src-container">
<pre class="src src-rust">let turing = Some("Turing");
let mut logicians = vec!["Curry", "Kleene", "Markov"];

logicians.extend(turing);

// equivalent to
if let Some(turing_inner) = turing {
    logicians.push(turing_inner);
}
</pre>
</div>

<p>
This works because <code>Option</code> implements <code>IntoIterator</code> and so does <code>Vec</code>.
Therefore if we perform the <code>extend</code> action it will either work, or not (<code>OK</code> or
<code>Err</code>).
</p>
</div>
</div>
