content/notes/rust.org
** Pass variables to closure
First to describe what a closure is. It is a functional programming paradigm. In
rust they are defined as:

#+begin_verse
Rust’s closures are anonymous functions you can save in a variable or pass as
arguments to other functions. You can create the closure in one place and then
call the closure elsewhere to evaluate it in a different context. Unlike
functions, closures can capture values from the scope in which they’re
defined. We’ll demonstrate how these closure features allow for code reuse and
behavior customization.
#+end_verse

To read more on it, [[https://doc.rust-lang.org/book/ch13-01-closures.html?highlight=closure#moving-captured-values-out-of-closures-and-the-fn-traits][here is a link to the book]]. As an example:

#+begin_src rust
use std::rc::Rc;

let num1 = Rc::new(1);
let num2 = Rc::new(2);
let num3 = Rc::new(3);
let closure = {
    // `num1` is moved
    let num2 = num2.clone();  // `num2` is cloned
    let num3 = num3.as_ref();  // `num3` is borrowed
    move || {
        *num1 + *num2 + *num3;
    }
};
#+end_src

where [[https://doc.rust-lang.org/std/rc/index.html][~Rc~]] and [[https://doc.rust-lang.org/std/keyword.move.html][~move~]] are as documented.

** Easy doc initialization
If a struct takes significant effort to initialize when writing docs, it can be
quicker to wrap your example with a helper function which takes the struct as an
argument. This the method that is used when reading through the rust books and some
 of the code is hidden.

If you have something like this to initialize:

#+begin_src rust
struct Connection {
    name: String,
    stream: TcpStream,
}

impl Connection {
    /// Sends a request over the connection.
    ///
    /// # Example
    /// ```no_run
    /// # // Boilerplate are required to get an example working.
    /// # let stream = TcpStream::connect("127.0.0.1:34254");
    /// # let connection = Connection { name: "foo".to_owned(), stream };
    /// # let request = Request::new("RequestId", RequestType::Get, "payload");
    /// let response = connection.send_request(request);
    /// assert!(response.is_ok());
    /// ```
    fn send_request(&self, request: Request) -> Result<Status, SendErr> {
        // ...
    }

    /// Oh no, all that boilerplate needs to be repeated here!
    fn check_status(&self) -> Status {
        // ...
    }
}
#+end_src

Instead of typing all of this boilerplate to create a Connection and Request, it
is easier to just create a wrapping helper function which takes them as
arguments:

#+begin_src rust
struct Connection {
    name: String,
    stream: TcpStream,
}

impl Connection {
    /// Sends a request over the connection.
    ///
    /// # Example
    /// ```
    /// # fn call_send(connection: Connection, request: Request) {
    /// let response = connection.send_request(request);
    /// assert!(response.is_ok());
    /// # }
    /// ```
    fn send_request(&self, request: Request) {
        // ...
    }
}
#+end_src

*Note* in the above example the line ~assert!(response.is_ok());~ will not
actually run while testing because it is inside a function which is never
invoked.

When running tests, the code in the comments will not actually be ran, but it
will be compiled.

** Temporary mutability
Often it is necessary to prepare and process some data, but after that data are
only inspected and never modified. The intention can be made explicit by
redefining the mutable variable as immutable.

It can be done either by processing data within a nested block or by redefining
the variable.

#+name: Nesting block
#+begin_src rust
struct Connection {
    name: String,
    stream: TcpStream,
}

impl Connection {
    /// Sends a request over the connection.
    ///
    /// # Example
    /// ```
    /// # fn call_send(connection: Connection, request: Request) {
    /// let response = connection.send_request(request);
    /// assert!(response.is_ok());
    /// # }
    /// ```
    fn send_request(&self, request: Request) {
        // ...
    }
}
#+end_src

#+name: Variable rebinding
#+begin_src rust
let mut data = get_vec();
data.sort();
let data = data;

// Here `data` is immutable.
#+end_src

* Design Patterns
[[https://rust-unofficial.github.io/patterns/patterns/index.html][This directly from the book]]:

#+begin_quote
Design patterns are "general reusable solutions to a commonly occurring problem
within a given context in software design". Design patterns are a great way to
describe the culture of a programming language. Design patterns are very
language-specific - what is a pattern in one language may be unnecessary in
another due to a language feature, or impossible to express due to a missing
feature.

If overused, design patterns can add unnecessary complexity to
programs. However, they are a great way to share intermediate and advanced level
knowledge about a programming language.

Rust has many unique features. These features give us
great benefit by removing whole classes of problems. Some of them are also
patterns that are unique to Rust.

YAGNI is an acronym that stands for You Aren't Going to Need It. It's a
vital software design principle to apply as you write code.

The best code I ever wrote was code I never wrote.

If we apply YAGNI to design patterns, we see that the features of Rust allow us
to throw out many patterns. For instance, there is no need for the strategy
pattern in Rust because we can just use traits.
#+end_quote

** Behavioral Patterns
Design patterns that identify common communication patterns among objects. By
doing so, these patterns increase flexibility in carrying out communication.

*** Command
The basic idea of the Command pattern is to separate out actions into its own
objects and pass them as parameters.

