docs/rust.html

<div id="outline-container-org84b3d2a" class="outline-3">
<h3 id="org84b3d2a"><span class="section-number-3">1.10.</span> Pass variables to closure</h3>
<div class="outline-text-3" id="text-1-10">
<p>
First to describe what a closure is. It is a functional programming paradigm. In
rust they are defined as:
</p>

<p class="verse">
Rust’s closures are anonymous functions you can save in a variable or pass as<br />
arguments to other functions. You can create the closure in one place and then<br />
call the closure elsewhere to evaluate it in a different context. Unlike<br />
functions, closures can capture values from the scope in which they’re<br />
defined. We’ll demonstrate how these closure features allow for code reuse and<br />
behavior customization.<br />
</p>

<p>
To read more on it, <a href="https://doc.rust-lang.org/book/ch13-01-closures.html?highlight=closure#moving-captured-values-out-of-closures-and-the-fn-traits">here is a link to the book</a>. As an example:
</p>

<div class="org-src-container">
<pre class="src src-rust">use std::rc::Rc;

let num1 = Rc::new(1);
let num2 = Rc::new(2);
let num3 = Rc::new(3);
let closure = {
    // `num1` is moved
    let num2 = num2.clone();  // `num2` is cloned
    let num3 = num3.as_ref();  // `num3` is borrowed
    move || {
	*num1 + *num2 + *num3;
    }
};
</pre>
</div>

<p>
where <a href="https://doc.rust-lang.org/std/rc/index.html"><code>Rc</code></a> and <a href="https://doc.rust-lang.org/std/keyword.move.html"><code>move</code></a> are as documented.
</p>
</div>
</div>

<div id="outline-container-org310d242" class="outline-3">
<h3 id="org310d242"><span class="section-number-3">1.11.</span> Easy doc initialization</h3>
<div class="outline-text-3" id="text-1-11">
<p>
If a struct takes significant effort to initialize when writing docs, it can be
quicker to wrap your example with a helper function which takes the struct as an
argument. This the method that is used when reading through the rust books and some
 of the code is hidden.
</p>

<p>
If you have something like this to initialize:
</p>

<div class="org-src-container">
<pre class="src src-rust">struct Connection {
    name: String,
    stream: TcpStream,
}

impl Connection {
    /// Sends a request over the connection.
    ///
    /// # Example
    /// ```no_run
    /// # // Boilerplate are required to get an example working.
    /// # let stream = TcpStream::connect("127.0.0.1:34254");
    /// # let connection = Connection { name: "foo".to_owned(), stream };
    /// # let request = Request::new("RequestId", RequestType::Get, "payload");
    /// let response = connection.send_request(request);
    /// assert!(response.is_ok());
    /// ```
    fn send_request(&amp;self, request: Request) -&gt; Result&lt;Status, SendErr&gt; {
	// ...
    }

    /// Oh no, all that boilerplate needs to be repeated here!
    fn check_status(&amp;self) -&gt; Status {
	// ...
    }
}
</pre>
</div>

<p>
Instead of typing all of this boilerplate to create a Connection and Request, it
is easier to just create a wrapping helper function which takes them as
arguments:
</p>

<div class="org-src-container">
<pre class="src src-rust">struct Connection {
    name: String,
    stream: TcpStream,
}

impl Connection {
    /// Sends a request over the connection.
    ///
    /// # Example
    /// ```
    /// # fn call_send(connection: Connection, request: Request) {
    /// let response = connection.send_request(request);
    /// assert!(response.is_ok());
    /// # }
    /// ```
    fn send_request(&amp;self, request: Request) {
	// ...
    }
}
</pre>
</div>

<p>
<b>Note</b> in the above example the line <code>assert!(response.is_ok());</code> will not
actually run while testing because it is inside a function which is never
invoked.
</p>

<p>
When running tests, the code in the comments will not actually be ran, but it
will be compiled.
</p>
</div>
</div>

<div id="outline-container-org63ddb93" class="outline-3">
<h3 id="org63ddb93"><span class="section-number-3">1.12.</span> Temporary mutability</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Often it is necessary to prepare and process some data, but after that data are
only inspected and never modified. The intention can be made explicit by
redefining the mutable variable as immutable.
</p>

<p>
It can be done either by processing data within a nested block or by redefining
the variable.
</p>

<div class="org-src-container">
<pre class="src src-rust" id="org38a8b24">struct Connection {
    name: String,
    stream: TcpStream,
}

impl Connection {
    /// Sends a request over the connection.
    ///
    /// # Example
    /// ```
    /// # fn call_send(connection: Connection, request: Request) {
    /// let response = connection.send_request(request);
    /// assert!(response.is_ok());
    /// # }
    /// ```
    fn send_request(&amp;self, request: Request) {
	// ...
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust" id="org5b65496">let mut data = get_vec();
data.sort();
let data = data;

// Here `data` is immutable.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb9ed06a" class="outline-2">
<h2 id="orgb9ed06a"><span class="section-number-2">2.</span> Design Patterns</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://rust-unofficial.github.io/patterns/patterns/index.html">This directly from the book</a>:
</p>

<blockquote>
<p>
Design patterns are "general reusable solutions to a commonly occurring problem
within a given context in software design". Design patterns are a great way to
describe the culture of a programming language. Design patterns are very
language-specific - what is a pattern in one language may be unnecessary in
another due to a language feature, or impossible to express due to a missing
feature.
</p>

<p>
If overused, design patterns can add unnecessary complexity to
programs. However, they are a great way to share intermediate and advanced level
knowledge about a programming language.
</p>

<p>
Rust has many unique features. These features give us
great benefit by removing whole classes of problems. Some of them are also
patterns that are unique to Rust.
</p>

<p>
YAGNI is an acronym that stands for You Aren't Going to Need It. It's a
vital software design principle to apply as you write code.
</p>

<p>
The best code I ever wrote was code I never wrote.
</p>

<p>
If we apply YAGNI to design patterns, we see that the features of Rust allow us
to throw out many patterns. For instance, there is no need for the strategy
pattern in Rust because we can just use traits.
</p>
</blockquote>
</div>

<div id="outline-container-org9aaaa55" class="outline-3">
<h3 id="org9aaaa55"><span class="section-number-3">2.1.</span> Behavioral Patterns</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Design patterns that identify common communication patterns among objects. By
doing so, these patterns increase flexibility in carrying out communication.
</p>
</div>

<div id="outline-container-org49188fa" class="outline-4">
<h4 id="org49188fa"><span class="section-number-4">2.1.1.</span> Command</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The basic idea of the Command pattern is to separate out actions into its own
objects and pass them as parameters.
</p>
</div>

<ol class="org-ol">
