docs/rust.html
<li><a id="orge53b5dd"></a>Example<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
Define two database operations <code>create table</code> and <code>add field</code>. Each of these
operations is a command which knows how to undo the command, e.g., <code>drop table</code>
and <code>remove field</code>. When a user invokes a database migration operation then each
command is executed in the defined order, and when the user invokes the rollback
operation then the whole set of commands is invoked in reverse order.
</p>

<div class="org-src-container">
<pre class="src src-rust" id="org4449287">  pub trait Migration {
    fn execute(&amp;self) -&gt; &amp;str;
    fn rollback(&amp;self) -&gt; &amp;str;
}

pub struct CreateTable;
impl Migration for CreateTable {
    fn execute(&amp;self) -&gt; &amp;str {
	"create table"
    }
    fn rollback(&amp;self) -&gt; &amp;str {
	"drop table"
    }
}

pub struct AddField;
impl Migration for AddField {
    fn execute(&amp;self) -&gt; &amp;str {
	"add field"
    }
    fn rollback(&amp;self) -&gt; &amp;str {
	"remove field"
    }
}

struct Schema {
    commands: Vec&lt;Box&lt;dyn Migration&gt;&gt;,
}

impl Schema {
    fn new() -&gt; Self {
	Self { commands: vec![] }
    }

    fn add_migration(&amp;mut self, cmd: Box&lt;dyn Migration&gt;) {
	self.commands.push(cmd);
    }

    fn execute(&amp;self) -&gt; Vec&lt;&amp;str&gt; {
	self.commands.iter().map(|cmd| cmd.execute()).collect()
    }
    fn rollback(&amp;self) -&gt; Vec&lt;&amp;str&gt; {
	self.commands
	    .iter()
	    .rev() // reverse iterator's direction
	    .map(|cmd| cmd.rollback())
	    .collect()
    }
}

fn main() {
    let mut schema = Schema::new();

    let cmd = Box::new(CreateTable);
    schema.add_migration(cmd);
    let cmd = Box::new(AddField);
    schema.add_migration(cmd);

    assert_eq!(vec!["create table", "add field"], schema.execute());
    assert_eq!(vec!["remove field", "drop table"], schema.rollback());
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust" id="orgf24d0a1">type FnPtr = fn() -&gt; String;
struct Command {
    execute: FnPtr,
    rollback: FnPtr,
}

struct Schema {
    commands: Vec&lt;Command&gt;,
}

impl Schema {
    fn new() -&gt; Self {
	Self { commands: vec![] }
    }
    fn add_migration(&amp;mut self, execute: FnPtr, rollback: FnPtr) {
	self.commands.push(Command { execute, rollback });
    }
    fn execute(&amp;self) -&gt; Vec&lt;String&gt; {
	self.commands.iter().map(|cmd| (cmd.execute)()).collect()
    }
    fn rollback(&amp;self) -&gt; Vec&lt;String&gt; {
	self.commands
	    .iter()
	    .rev()
	    .map(|cmd| (cmd.rollback)())
	    .collect()
    }
}

fn add_field() -&gt; String {
    "add field".to_string()
}

fn remove_field() -&gt; String {
    "remove field".to_string()
}

fn main() {
    let mut schema = Schema::new();
    schema.add_migration(|| "create table".to_string(), || "drop table".to_string());
    schema.add_migration(add_field, remove_field);
    assert_eq!(vec!["create table", "add field"], schema.execute());
    assert_eq!(vec!["remove field", "drop table"], schema.rollback());
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust" id="org8047f05">type Migration&lt;'a&gt; = Box&lt;dyn Fn() -&gt; &amp;'a str&gt;;

struct Schema&lt;'a&gt; {
    executes: Vec&lt;Migration&lt;'a&gt;&gt;,
    rollbacks: Vec&lt;Migration&lt;'a&gt;&gt;,
}

impl&lt;'a&gt; Schema&lt;'a&gt; {
    fn new() -&gt; Self {
	Self {
	    executes: vec![],
	    rollbacks: vec![],
	}
    }
    fn add_migration&lt;E, R&gt;(&amp;mut self, execute: E, rollback: R)
    where
	E: Fn() -&gt; &amp;'a str + 'static,
	R: Fn() -&gt; &amp;'a str + 'static,
    {
	self.executes.push(Box::new(execute));
	self.rollbacks.push(Box::new(rollback));
    }
    fn execute(&amp;self) -&gt; Vec&lt;&amp;str&gt; {
	self.executes.iter().map(|cmd| cmd()).collect()
    }
    fn rollback(&amp;self) -&gt; Vec&lt;&amp;str&gt; {
	self.rollbacks.iter().rev().map(|cmd| cmd()).collect()
    }
}

fn add_field() -&gt; &amp;'static str {
    "add field"
}

fn remove_field() -&gt; &amp;'static str {
    "remove field"
}

fn main() {
    let mut schema = Schema::new();
    schema.add_migration(|| "create table", || "drop table");
    schema.add_migration(add_field, remove_field);
    assert_eq!(vec!["create table", "add field"], schema.execute());
    assert_eq!(vec!["remove field", "drop table"], schema.rollback());
}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org7e0f99a" class="outline-4">
<h4 id="org7e0f99a"><span class="section-number-4">2.1.2.</span> Newtype</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
What if in some cases we want a type to behave similar to another type or
enforce some behavior at compile time when using only type aliases would not be
enough?
</p>

<p>
For example, if we want to create a custom Display implementation for String due
to security considerations (e.g. passwords).
</p>

<p>
For such cases we could use the Newtype pattern to provide type safety and
encapsulation.
</p>

<div class="org-src-container">
<pre class="src src-rust">// Some type, not necessarily in the same module or even crate.
struct Foo {
    //..
}

impl Foo {
    // These functions are not present on Bar.
    //..
}

// The newtype.
pub struct Bar(Foo);

impl Bar {
    // Constructor.
    pub fn new(
	//..
    ) -&gt; Self {

	//..

    }

    //..
}

fn main() {
    let b = Bar::new(...);

    // Foo and Bar are type incompatible, the following do not type check.
    // let f: Foo = b;
    // let b: Bar = Foo { ... };
}
</pre>
</div>

<p>
<a href="https://doc.rust-lang.org/stable/book/ch19-04-advanced-types.html#creating-type-synonyms-with-type-aliases">More on typing here.</a>
</p>
</div>
</div>

<div id="outline-container-orgdc93084" class="outline-4">
<h4 id="orgdc93084"><span class="section-number-4">2.1.3.</span> Resource Acquisition is Initialization (RAII)</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
RAII is a useful pattern for ensuring resources are properly deallocated or
finalised. We can make use of the borrow checker in Rust to statically prevent
errors stemming from using resources after finalisation takes place.
</p>

<div class="org-src-container">
<pre class="src src-rust">use std::ops::Deref;

struct Foo {}

struct Mutex&lt;T&gt; {
    // We keep a reference to our data: T here.
    //..
}

struct MutexGuard&lt;'a, T: 'a&gt; {
    data: &amp;'a T,
    //..
}

// Locking the mutex is explicit.
impl&lt;T&gt; Mutex&lt;T&gt; {
    fn lock(&amp;self) -&gt; MutexGuard&lt;T&gt; {
	// Lock the underlying OS mutex.
	//..

	// MutexGuard keeps a reference to self
	MutexGuard {
	    data: self,
	    //..
	}
    }
}

// Destructor for unlocking the mutex.
impl&lt;'a, T&gt; Drop for MutexGuard&lt;'a, T&gt; {
    fn drop(&amp;mut self) {
	// Unlock the underlying OS mutex.
	//..
    }
}

// Implementing Deref means we can treat MutexGuard like a pointer to T.
impl&lt;'a, T&gt; Deref for MutexGuard&lt;'a, T&gt; {
    type Target = T;

    fn deref(&amp;self) -&gt; &amp;T {
	self.data
    }
}

fn baz(x: Mutex&lt;Foo&gt;) {
    let xx = x.lock();
    xx.foo(); // foo is a method on Foo.
    // The borrow checker ensures we can't store a reference to the underlying
    // Foo which will outlive the guard xx.

    // x is unlocked when we exit this function and xx's destructor is executed.
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org27950c4" class="outline-4">
<h4 id="org27950c4"><span class="section-number-4">2.1.4.</span> Strategy (aka Policy)</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
The Strategy design pattern is a technique that enables separation of
concerns. It also allows to decouple software modules through Dependency
Inversion.
</p>

<p>
The basic idea behind the Strategy pattern is that, given an algorithm solving a
particular problem, we define only the skeleton of the algorithm at an abstract
level, and we separate the specific algorithm’s implementation into different
parts.
</p>

<p>
In this way, a client using the algorithm may choose a specific implementation,
while the general algorithm workflow remains the same. In other words, the
abstract specification of the class does not depend on the specific
implementation of the derived class, but specific implementation must adhere to
the abstract specification. This is why we call it "Dependency Inversion".
</p>
</div>

<ol class="org-ol">
