docs/rust.html
<li><a id="org708e5f7"></a>Example<br />
<div class="outline-text-5" id="text-2-1-4-1">
<p>
Imagine we are working on a project that generates reports every month. We need
the reports to be generated in different formats (strategies), e.g., in <code>JSON</code>
or <code>Plain Text</code> formats. But things vary over time, and we don't know what kind
of requirement we may get in the future. For example, we may need to generate
our report in a completely new format, or just modify one of the existing
formats.
</p>

<div class="org-src-container">
<pre class="src src-rust">use std::collections::HashMap;

type Data = HashMap&lt;String, u32&gt;;

trait Formatter {
    fn format(&amp;self, data: &amp;Data, buf: &amp;mut String);
}

struct Report;

impl Report {
    // Write should be used but we kept it as String to ignore error handling
    fn generate&lt;T: Formatter&gt;(g: T, s: &amp;mut String) {
	// backend operations...
	let mut data = HashMap::new();
	data.insert("one".to_string(), 1);
	data.insert("two".to_string(), 2);
	// generate report
	g.format(&amp;data, s);
    }
}

struct Text;
impl Formatter for Text {
    fn format(&amp;self, data: &amp;Data, buf: &amp;mut String) {
	for (k, v) in data {
	    let entry = format!("{} {}\n", k, v);
	    buf.push_str(&amp;entry);
	}
    }
}

struct Json;
impl Formatter for Json {
    fn format(&amp;self, data: &amp;Data, buf: &amp;mut String) {
	buf.push('[');
	for (k, v) in data.into_iter() {
	    let entry = format!(r#"{{"{}":"{}"}}"#, k, v);
	    buf.push_str(&amp;entry);
	    buf.push(',');
	}
	buf.pop(); // remove extra , at the end
	buf.push(']');
    }
}

fn main() {
    let mut s = String::from("");
    Report::generate(Text, &amp;mut s);
    assert!(s.contains("one 1"));
    assert!(s.contains("two 2"));

    s.clear(); // reuse the same buffer
    Report::generate(Json, &amp;mut s);
    assert!(s.contains(r#"{"one":"1"}"#));
    assert!(s.contains(r#"{"two":"2"}"#));
}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge8efd75" class="outline-4">
<h4 id="orge8efd75"><span class="section-number-4">2.1.5.</span> Visitor</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
A visitor encapsulates an algorithm that operates over a heterogeneous
collection of objects. It allows multiple different algorithms to be written
over the same data without having to modify the data (or their primary
behavior).
</p>

<p>
Furthermore, the visitor pattern allows separating the traversal of a collection
of objects from the operations performed on each object.
</p>

<p>
#+begin<sub>src</sub> rust
// The data we will visit
mod ast {
    pub enum Stmt {
        Expr(Expr),
        Let(Name, Expr),
    }
</p>

<p>
pub struct Name {
    value: String,
}
</p>

<p>
    pub enum Expr {
        IntLit(i64),
        Add(Box&lt;Expr&gt;, Box&lt;Expr&gt;),
        Sub(Box&lt;Expr&gt;, Box&lt;Expr&gt;),
    }
}
</p>

<p>
// The abstract visitor
mod visit {
    use ast::*;
</p>

<p>
    pub trait Visitor&lt;T&gt; {
        fn visit<sub>name</sub>(&amp;mut self, n: &amp;Name) -&gt; T;
        fn visit<sub>stmt</sub>(&amp;mut self, s: &amp;Stmt) -&gt; T;
        fn visit<sub>expr</sub>(&amp;mut self, e: &amp;Expr) -&gt; T;
    }
}
</p>

<p>
use visit::*;
use ast::*;
</p>

<p>
// An example concrete implementation - walks the AST interpreting it as code.
struct Interpreter;
impl Visitor&lt;i64&gt; for Interpreter {
    fn visit<sub>name</sub>(&amp;mut self, n: &amp;Name) -&gt; i64 { panic!() }
    fn visit<sub>stmt</sub>(&amp;mut self, s: &amp;Stmt) -&gt; i64 {
        match *s {
            Stmt::Expr(ref e) =&gt; self.visit<sub>expr</sub>(e),
            Stmt::Let(..) =&gt; unimplemented!(),
        }
    }
</p>

<p>
    fn visit<sub>expr</sub>(&amp;mut self, e: &amp;Expr) -&gt; i64 {
        match *e {
            Expr::IntLit(n) =&gt; n,
            Expr::Add(ref lhs, ref rhs) =&gt; self.visit<sub>expr</sub>(lhs) + self.visit<sub>expr</sub>(rhs),
            Expr::Sub(ref lhs, ref rhs) =&gt; self.visit<sub>expr</sub>(lhs) - self.visit<sub>expr</sub>(rhs),
        }
    }
}
#+end<sub>arc</sub>
</p>
</div>
</div>
</div>

<div id="outline-container-orge0aa25c" class="outline-3">
<h3 id="orge0aa25c"><span class="section-number-3">2.2.</span> Creational Patterns</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Design patterns that deal with object creation mechanisms, trying to create
objects in a manner suitable to the situation. The basic form of object creation
could result in design problems or in added complexity to the design. Creational
design patterns solve this problem by somehow controlling this object creation.
</p>
</div>

<div id="outline-container-org9574081" class="outline-4">
<h4 id="org9574081"><span class="section-number-4">2.2.1.</span> Builder</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Construct an object with calls to a builder helper. This pattern is seen more
frequently in Rust (and for simpler objects) than in many other languages
because Rust lacks overloading. Since you can only have a single method with a
given name, having multiple constructors is less nice in Rust than in C++, Java,
or others.
</p>

<div class="org-src-container">
<pre class="src src-rust">#![allow(unused)]
fn main() {
#[derive(Debug, PartialEq)]
pub struct Foo {
    // Lots of complicated fields.
    bar: String,
}

impl Foo {
    // This method will help users to discover the builder
    pub fn builder() -&gt; FooBuilder {
	FooBuilder::default()
    }
}

#[derive(Default)]
pub struct FooBuilder {
    // Probably lots of optional fields.
    bar: String,
}

impl FooBuilder {
    pub fn new(/* ... */) -&gt; FooBuilder {
	// Set the minimally required fields of Foo.
	FooBuilder {
	    bar: String::from("X"),
	}
    }

    pub fn name(mut self, bar: String) -&gt; FooBuilder {
	// Set the name on the builder itself, and return the builder by value.
	self.bar = bar;
	self
    }

    // If we can get away with not consuming the Builder here, that is an
    // advantage. It means we can use the FooBuilder as a template for constructing
    // many Foos.
    pub fn build(self) -&gt; Foo {
	// Create a Foo from the FooBuilder, applying all settings in FooBuilder
	// to Foo.
	Foo { bar: self.bar }
    }
}

#[test]
fn builder_test() {
    let foo = Foo {
	bar: String::from("Y"),
    };
    let foo_from_builder: Foo = FooBuilder::new().name(String::from("Y")).build();
    assert_eq!(foo, foo_from_builder);
}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7312853" class="outline-4">
<h4 id="org7312853"><span class="section-number-4">2.2.2.</span> Fold</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Run an algorithm over each item in a collection of data to create a new item,
thus creating a whole new collection. This seems like a weird sort of
inheritance model.
</p>

<div class="org-src-container">
<pre class="src src-rust">// The data we will fold, a simple AST.
mod ast {
    pub enum Stmt {
	Expr(Box&lt;Expr&gt;),
	Let(Box&lt;Name&gt;, Box&lt;Expr&gt;),
    }

    pub struct Name {
	value: String,
    }

    pub enum Expr {
	IntLit(i64),
	Add(Box&lt;Expr&gt;, Box&lt;Expr&gt;),
	Sub(Box&lt;Expr&gt;, Box&lt;Expr&gt;),
    }
}

// The abstract folder
mod fold {
    use ast::*;

    pub trait Folder {
	// A leaf node just returns the node itself. In some cases, we can do this
	// to inner nodes too.
	fn fold_name(&amp;mut self, n: Box&lt;Name&gt;) -&gt; Box&lt;Name&gt; { n }
	// Create a new inner node by folding its children.
	fn fold_stmt(&amp;mut self, s: Box&lt;Stmt&gt;) -&gt; Box&lt;Stmt&gt; {
	    match *s {
		Stmt::Expr(e) =&gt; Box::new(Stmt::Expr(self.fold_expr(e))),
		Stmt::Let(n, e) =&gt; Box::new(Stmt::Let(self.fold_name(n), self.fold_expr(e))),
	    }
	}
	fn fold_expr(&amp;mut self, e: Box&lt;Expr&gt;) -&gt; Box&lt;Expr&gt; { ... }
    }
}

use fold::*;
use ast::*;

// An example concrete implementation - renames every name to 'foo'.
struct Renamer;
impl Folder for Renamer {
    fn fold_name(&amp;mut self, n: Box&lt;Name&gt;) -&gt; Box&lt;Name&gt; {
	Box::new(Name { value: "foo".to_owned() })
    }
    // Use the default methods for the other nodes.
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b30ca6" class="outline-3">
<h3 id="org9b30ca6"><span class="section-number-3">2.3.</span> Structural Patterns</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Design patterns that ease the design by identifying a simple way to realize
relationships among entities.
</p>
</div>
