content/notes/rust.org
*** Compose structs together for better borrowing
Sometimes a large struct will cause issues with the borrow checker - although
fields can be borrowed independently, sometimes the whole struct ends up being
used at once, preventing other uses. A solution might be to decompose the structure
into several smaller structures. Then compose these together into the original
struct. Then each struct can be borrowed separately and have more flexible
behavior.

**** Example
#+begin_src rust
#![allow(unused)]
fn main() {
struct A {
    f1: u32,
    f2: u32,
    f3: u32,
}

fn foo(a: &mut A) -> &u32 { &a.f2 }
fn bar(a: &mut A) -> u32 { a.f1 + a.f3 }

fn baz(a: &mut A) {
    // The later usage of x causes a to be borrowed for the rest of the function.
    let x = foo(a);
    // Borrow checker error:
    // let y = bar(a); // ~ ERROR: cannot borrow `*a` as mutable more than once
                       //          at a time
    println!("{}", x);
}
}
#+end_src

To fix this

#+begin_src rust
#![allow(unused)]
fn main() {
// A is now composed of two structs - B and C.
struct A {
    b: B,
    c: C,
}
struct B {
    f2: u32,
}
struct C {
    f1: u32,
    f3: u32,
}

// These functions take a B or C, rather than A.
fn foo(b: &mut B) -> &u32 { &b.f2 }
fn bar(c: &mut C) -> u32 { c.f1 + c.f3 }

fn baz(a: &mut A) {
    let x = foo(&mut a.b);
    // Now it's OK!
    let y = bar(&mut a.c);
    println!("{}", x);
}
}
#+end_src

*** Prefer small crates
Prefer small crates that do one thing well.

Cargo and crates.io make it easy to add third-party libraries, much more so than
in say C or C++. Moreover, since packages on crates.io cannot be edited or
removed after publication, any build that works now should continue to work in
the future. We should take advantage of this tooling, and use smaller, more
fine-grained dependencies.

* Functional Usage of Rust
In computer science, functional programming is a programming paradigm where
programs are constructed by applying and composing functions. It is a
declarative programming paradigm in which function definitions are trees of
expressions that each return a value, rather than a sequence of imperative
statements which change the state of the program.

** Programming paradigms
One of the biggest hurdles to understanding functional programs when coming from
an imperative background is the shift in thinking. Imperative programs describe
*how* to do something, whereas declarative programs describe *what* to do. Let's
sum the numbers from 1 to 10 to show this.

#+name: Imperative
#+begin_src rust
#![allow(unused)]
fn main() {
let mut sum = 0;
for i in 1..11 {
    sum += i;
}
println!("{}", sum);
}
#+end_src

#+name: Declarative
#+begin_src rust
#![allow(unused)]
fn main() {
println!("{}", (1..11).fold(0, |a, b| a + b));
}
#+end_src

** Generics as Type Classes
Rust's type system is designed more like functional languages (like Haskell)
rather than imperative languages (like Java and C++). As a result, Rust can turn
many kinds of programming problems into "static typing" problems. This is one of
the biggest wins of choosing a functional language, and is critical to many of
Rust's compile time guarantees.

#+begin_quote
A key part of this idea is the way generic types work. In C++ and Java, for
example, generic types are a meta-programming construct for the
compiler. ~vector<int>~ and ~vector<char>~ in C++ are just two different copies
of the same boilerplate code for a vector type (known as a ~template~) with two
different filled in.

In Rust, a generic type parameter creates what is known in functional languages
as a "type class constraint", and each different parameter filled in by an end
user *actually changes the type*. In other words, ~Vec<isize>~ and ~Vec<char>~
are two different types, which are recognized as distinct by all parts of the
type system.
#+end_quote

* References
[[https://rust-unofficial.github.io/patterns/intro.html][- Rust Design Patterns]]
