docs/rust.html

<div id="outline-container-orgc0b71e2" class="outline-4">
<h4 id="orgc0b71e2"><span class="section-number-4">2.3.1.</span> Compose structs together for better borrowing</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Sometimes a large struct will cause issues with the borrow checker - although
fields can be borrowed independently, sometimes the whole struct ends up being
used at once, preventing other uses. A solution might be to decompose the structure
into several smaller structures. Then compose these together into the original
struct. Then each struct can be borrowed separately and have more flexible
behavior.
</p>
</div>

<ol class="org-ol">
<li><a id="org76dcc7a"></a>Example<br />
<div class="outline-text-5" id="text-2-3-1-1">
<div class="org-src-container">
<pre class="src src-rust">#![allow(unused)]
fn main() {
struct A {
    f1: u32,
    f2: u32,
    f3: u32,
}

fn foo(a: &amp;mut A) -&gt; &amp;u32 { &amp;a.f2 }
fn bar(a: &amp;mut A) -&gt; u32 { a.f1 + a.f3 }

fn baz(a: &amp;mut A) {
    // The later usage of x causes a to be borrowed for the rest of the function.
    let x = foo(a);
    // Borrow checker error:
    // let y = bar(a); // ~ ERROR: cannot borrow `*a` as mutable more than once
		       //          at a time
    println!("{}", x);
}
}
</pre>
</div>

<p>
To fix this
</p>

<div class="org-src-container">
<pre class="src src-rust">#![allow(unused)]
fn main() {
// A is now composed of two structs - B and C.
struct A {
    b: B,
    c: C,
}
struct B {
    f2: u32,
}
struct C {
    f1: u32,
    f3: u32,
}

// These functions take a B or C, rather than A.
fn foo(b: &amp;mut B) -&gt; &amp;u32 { &amp;b.f2 }
fn bar(c: &amp;mut C) -&gt; u32 { c.f1 + c.f3 }

fn baz(a: &amp;mut A) {
    let x = foo(&amp;mut a.b);
    // Now it's OK!
    let y = bar(&amp;mut a.c);
    println!("{}", x);
}
}
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org47959f3" class="outline-4">
<h4 id="org47959f3"><span class="section-number-4">2.3.2.</span> Prefer small crates</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Prefer small crates that do one thing well.
</p>

<p>
Cargo and crates.io make it easy to add third-party libraries, much more so than
in say C or C++. Moreover, since packages on crates.io cannot be edited or
removed after publication, any build that works now should continue to work in
the future. We should take advantage of this tooling, and use smaller, more
fine-grained dependencies.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb6e4d51" class="outline-2">
<h2 id="orgb6e4d51"><span class="section-number-2">3.</span> Functional Usage of Rust</h2>
<div class="outline-text-2" id="text-3">
<p>
In computer science, functional programming is a programming paradigm where
programs are constructed by applying and composing functions. It is a
declarative programming paradigm in which function definitions are trees of
expressions that each return a value, rather than a sequence of imperative
statements which change the state of the program.
</p>
</div>

<div id="outline-container-org86a9d24" class="outline-3">
<h3 id="org86a9d24"><span class="section-number-3">3.1.</span> Programming paradigms</h3>
<div class="outline-text-3" id="text-3-1">
<p>
One of the biggest hurdles to understanding functional programs when coming from
an imperative background is the shift in thinking. Imperative programs describe
<b>how</b> to do something, whereas declarative programs describe <b>what</b> to do. Let's
sum the numbers from 1 to 10 to show this.
</p>

<div class="org-src-container">
<pre class="src src-rust" id="org7bb20df">#![allow(unused)]
fn main() {
let mut sum = 0;
for i in 1..11 {
    sum += i;
}
println!("{}", sum);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust" id="org77f89ae">#![allow(unused)]
fn main() {
println!("{}", (1..11).fold(0, |a, b| a + b));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org71dbcd5" class="outline-3">
<h3 id="org71dbcd5"><span class="section-number-3">3.2.</span> Generics as Type Classes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Rust's type system is designed more like functional languages (like Haskell)
rather than imperative languages (like Java and C++). As a result, Rust can turn
many kinds of programming problems into "static typing" problems. This is one of
the biggest wins of choosing a functional language, and is critical to many of
Rust's compile time guarantees.
</p>

<blockquote>
<p>
A key part of this idea is the way generic types work. In C++ and Java, for
example, generic types are a meta-programming construct for the
compiler. <code>vector&lt;int&gt;</code> and <code>vector&lt;char&gt;</code> in C++ are just two different copies
of the same boilerplate code for a vector type (known as a <code>template</code>) with two
different filled in.
</p>

<p>
In Rust, a generic type parameter creates what is known in functional languages
as a "type class constraint", and each different parameter filled in by an end
user <b>actually changes the type</b>. In other words, <code>Vec&lt;isize&gt;</code> and <code>Vec&lt;char&gt;</code>
are two different types, which are recognized as distinct by all parts of the
type system.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orge3aa7ce" class="outline-2">
<h2 id="orge3aa7ce"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://rust-unofficial.github.io/patterns/intro.html">- Rust Design Patterns</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-02-16 Thu 19:32</p>
</div>
</body>
</html>
